# RebarShapeConstraint Properties

---
The RebarShapeConstraint type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
RebarShapeConstraint Class
Autodesk.Revit.DB.Structure Namespace